## 1. 대학 데이터셋을 사용해 소수 인종이 다수인 주 찾기

In [1]:
import pandas as pd
import numpy as np

In [2]:
college = pd.read_csv('data/college.csv', index_col='INSTNM')
college.head()

,CITY,STABBR,HBCU,MENONLY,WOMENONLY,RELAFFIL,SATVRMID,SATMTMID,DISTANCEONLY,UGDS,...,UGDS_2MOR,UGDS_NRA,UGDS_UNKN,PPTUG_EF,CURROPER,PCTPELL,PCTFLOAN,UG25ABV,MD_EARN_WNE_P10,GRAD_DEBT_MDN_SUPP
INSTNM,,,,,,,,,,,,,,,,,,,,,
Alabama A & M University,Normal,AL,1.0,0.0,0.0,0,424.0,420.0,0.0,4206.0,...,0.0000,0.0059,0.0138,0.0656,1,0.7356,0.8284,0.1049,30300,33888
University of Alabama at Birmingham,Birmingham,AL,0.0,0.0,0.0,0,570.0,565.0,0.0,11383.0,...,0.0368,0.0179,0.0100,0.2607,1,0.3460,0.5214,0.2422,39700,21941.5
Amridge University,Montgomery,AL,0.0,0.0,0.0,1,NaN,NaN,1.0,291.0,...,0.0000,0.0000,0.2715,0.4536,1,0.6801,0.7795,0.8540,40100,23370
University of Alabama in Huntsville,Huntsville,AL,0.0,0.0,0.0,0,595.0,590.0,0.0,5451.0,...,0.0172,0.0332,0.0350,0.2146,1,0.3072,0.4596,0.2640,45500,24097
Alabama State University,Montgomery,AL,1.0,0.0,0.0,0,425.0,430.0,0.0,4811.0,...,0.0098,0.0243,0.0137,0.0892,1,0.7347,0.7554,0.1270,26600,33118.5

In [3]:
grouped = college.groupby('STABBR')

In [4]:
def check_m(df, threshold):
    m_pct = 1 - df['UGDS_WHITE']
    total_m = (df['UGDS'] * m_pct).sum()
    total_ugds = df['UGDS'].sum()
    total_m_pct = total_m / total_ugds
    return total_m_pct > threshold

In [5]:
c_filter = grouped.filter(check_m, threshold=0.5)
c_filter.head()

,CITY,STABBR,HBCU,MENONLY,WOMENONLY,RELAFFIL,SATVRMID,SATMTMID,DISTANCEONLY,UGDS,...,UGDS_2MOR,UGDS_NRA,UGDS_UNKN,PPTUG_EF,CURROPER,PCTPELL,PCTFLOAN,UG25ABV,MD_EARN_WNE_P10,GRAD_DEBT_MDN_SUPP
INSTNM,,,,,,,,,,,,,,,,,,,,,
Everest College-Phoenix,Phoenix,AZ,0.0,0.0,0.0,1,NaN,NaN,0.0,4102.0,...,0.0373,0.0,0.1026,0.4749,0,0.8291,0.7151,0.6700,28600,9500
Collins College,Phoenix,AZ,0.0,0.0,0.0,0,NaN,NaN,0.0,83.0,...,0.0241,0.0,0.3855,0.3373,0,0.7205,0.8228,0.4764,25700,47000
Empire Beauty School-Paradise Valley,Phoenix,AZ,0.0,0.0,0.0,1,NaN,NaN,0.0,25.0,...,0.0400,0.0,0.0000,0.1600,0,0.6349,0.5873,0.4651,17800,9588
Empire Beauty School-Tucson,Tucson,AZ,0.0,0.0,0.0,0,NaN,NaN,0.0,126.0,...,0.0000,0.0,0.0079,0.2222,1,0.7962,0.6615,0.4229,18200,9833
Thunderbird School of Global Management,Glendale,AZ,0.0,0.0,0.0,0,NaN,NaN,0.0,1.0,...,0.0000,0.0,0.0000,1.0000,0,0.0000,0.0000,0.0000,118900,PrivacySuppressed

In [6]:
college.shape

(7535, 26)

In [7]:
c_filter.shape

(3028, 26)

In [8]:
c_filter['STABBR'].nunique()

20

## 2. 체중 감량 내기의 승자 찾기

In [9]:
weight_loss = pd.read_csv('data/weight_loss.csv')
weight_loss.query("Month == 'Jan'")

  Name Month    Week  Weight
0  Bob   Jan  Week 1     291
1  Amy   Jan  Week 1     197
2  Bob   Jan  Week 2     288
3  Amy   Jan  Week 2     189
4  Bob   Jan  Week 3     283
5  Amy   Jan  Week 3     189
6  Bob   Jan  Week 4     283
7  Amy   Jan  Week 4     190

In [15]:
# 무게감량 구하기
# (현재무게 - 처음무게)/처음무게
def find_perc_loss(s):
    return (s - s.iloc[0]) / s.iloc[0]

In [16]:
bob_jan = weight_loss.query("Name=='Bob' and Month=='Jan'")
bob_jan.head()

  Name Month    Week  Weight
0  Bob   Jan  Week 1     291
2  Bob   Jan  Week 2     288
4  Bob   Jan  Week 3     283
6  Bob   Jan  Week 4     283

In [17]:
bob_jan['Weight'].iloc[0]

291

In [18]:
(bob_jan['Weight'] - bob_jan['Weight'].iloc[0])/bob_jan['Weight'].iloc[0]

0    0.000000
2   -0.010309
4   -0.027491
6   -0.027491
Name: Weight, dtype: float64

In [19]:
find_perc_loss(bob_jan['Weight'])

0    0.000000
2   -0.010309
4   -0.027491
6   -0.027491
Name: Weight, dtype: float64

In [20]:
pcnt_loss = weight_loss.groupby(['Name','Month'])['Weight'].transform(find_perc_loss)
pcnt_loss.head()

0    0.000000
1    0.000000
2   -0.010309
3   -0.040609
4   -0.027491
Name: Weight, dtype: float64

In [21]:
weight_loss['Perc Weight Loss'] = pcnt_loss

In [22]:
weight_loss.head()

  Name Month    Week  Weight  Perc Weight Loss
0  Bob   Jan  Week 1     291          0.000000
1  Amy   Jan  Week 1     197          0.000000
2  Bob   Jan  Week 2     288         -0.010309
3  Amy   Jan  Week 2     189         -0.040609
4  Bob   Jan  Week 3     283         -0.027491

In [23]:
weight_loss.query("Name=='Bob' and Month in ['Jan','Feb']")

   Name Month    Week  Weight  Perc Weight Loss
0   Bob   Jan  Week 1     291          0.000000
2   Bob   Jan  Week 2     288         -0.010309
4   Bob   Jan  Week 3     283         -0.027491
6   Bob   Jan  Week 4     283         -0.027491
8   Bob   Feb  Week 1     283          0.000000
10  Bob   Feb  Week 2     275         -0.028269
12  Bob   Feb  Week 3     268         -0.053004
14  Bob   Feb  Week 4     268         -0.053004

In [24]:
week4 = weight_loss.query('Week == "Week 4"')
week4

   Name Month    Week  Weight  Perc Weight Loss
6   Bob   Jan  Week 4     283         -0.027491
7   Amy   Jan  Week 4     190         -0.035533
14  Bob   Feb  Week 4     268         -0.053004
15  Amy   Feb  Week 4     173         -0.089474
22  Bob   Mar  Week 4     261         -0.026119
23  Amy   Mar  Week 4     170         -0.017341
30  Bob   Apr  Week 4     250         -0.042146
31  Amy   Apr  Week 4     161         -0.052941

In [25]:
winner = week4.pivot(index='Month', columns='Name', values='Perc Weight Loss')
winner

Name        Amy       Bob
Month
Apr   -0.052941 -0.042146
Feb   -0.089474 -0.053004
Jan   -0.035533 -0.027491
Mar   -0.017341 -0.026119

In [ ]:
# np.where :  조건에 맞는 값을 특정 다른 값으로 변환하기
# np.where(조건, 조건에 맞을 때 값, 조건과 다를 때 값)
x = np.array([5, 4, 3, 2, 1, 0])
np.where(x >= 3, 3, x)

In [ ]:
winner['Winner'] = np.where(winner['Amy']<winner['Bob'], 'Amy','Bob')

In [ ]:
winner['Winner']

In [ ]:
winner.style.highlight_min(axis=1)

In [ ]:
winner.Winner.value_counts()

## 3. 주별 가중 평균 SAT 점수 계산

In [26]:
college.head()

,CITY,STABBR,HBCU,MENONLY,WOMENONLY,RELAFFIL,SATVRMID,SATMTMID,DISTANCEONLY,UGDS,...,UGDS_2MOR,UGDS_NRA,UGDS_UNKN,PPTUG_EF,CURROPER,PCTPELL,PCTFLOAN,UG25ABV,MD_EARN_WNE_P10,GRAD_DEBT_MDN_SUPP
INSTNM,,,,,,,,,,,,,,,,,,,,,
Alabama A & M University,Normal,AL,1.0,0.0,0.0,0,424.0,420.0,0.0,4206.0,...,0.0000,0.0059,0.0138,0.0656,1,0.7356,0.8284,0.1049,30300,33888
University of Alabama at Birmingham,Birmingham,AL,0.0,0.0,0.0,0,570.0,565.0,0.0,11383.0,...,0.0368,0.0179,0.0100,0.2607,1,0.3460,0.5214,0.2422,39700,21941.5
Amridge University,Montgomery,AL,0.0,0.0,0.0,1,NaN,NaN,1.0,291.0,...,0.0000,0.0000,0.2715,0.4536,1,0.6801,0.7795,0.8540,40100,23370
University of Alabama in Huntsville,Huntsville,AL,0.0,0.0,0.0,0,595.0,590.0,0.0,5451.0,...,0.0172,0.0332,0.0350,0.2146,1,0.3072,0.4596,0.2640,45500,24097
Alabama State University,Montgomery,AL,1.0,0.0,0.0,0,425.0,430.0,0.0,4811.0,...,0.0098,0.0243,0.0137,0.0892,1,0.7347,0.7554,0.1270,26600,33118.5

In [27]:
# 아래에서 5개 볼때
college.tail()

,CITY,STABBR,HBCU,MENONLY,WOMENONLY,RELAFFIL,SATVRMID,SATMTMID,DISTANCEONLY,UGDS,...,UGDS_2MOR,UGDS_NRA,UGDS_UNKN,PPTUG_EF,CURROPER,PCTPELL,PCTFLOAN,UG25ABV,MD_EARN_WNE_P10,GRAD_DEBT_MDN_SUPP
INSTNM,,,,,,,,,,,,,,,,,,,,,
SAE Institute of Technology San Francisco,Emeryville,CA,NaN,NaN,NaN,1,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,1,NaN,NaN,NaN,NaN,9500
Rasmussen College - Overland Park,Overland Park,KS,NaN,NaN,NaN,1,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,1,NaN,NaN,NaN,NaN,21163
National Personal Training Institute of Cleveland,Highland Heights,OH,NaN,NaN,NaN,1,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,1,NaN,NaN,NaN,NaN,6333
Bay Area Medical Academy - San Jose Satellite Location,San Jose,CA,NaN,NaN,NaN,1,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,1,NaN,NaN,NaN,NaN,PrivacySuppressed
Excel Learning Center-San Antonio South,San Antonio,TX,NaN,NaN,NaN,1,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,1,NaN,NaN,NaN,NaN,12125

In [28]:
subset = ['UGDS', 'SATMTMID']
college2 = college.dropna(subset=subset)

In [29]:
college2.tail()

,CITY,STABBR,HBCU,MENONLY,WOMENONLY,RELAFFIL,SATVRMID,SATMTMID,DISTANCEONLY,UGDS,...,UGDS_2MOR,UGDS_NRA,UGDS_UNKN,PPTUG_EF,CURROPER,PCTPELL,PCTFLOAN,UG25ABV,MD_EARN_WNE_P10,GRAD_DEBT_MDN_SUPP
INSTNM,,,,,,,,,,,,,,,,,,,,,
Pennsylvania State University-World Campus,University Park,PA,0.0,0.0,0.0,0,510.0,505.0,1.0,5736.0,...,0.0282,0.0115,0.0328,0.6968,1,0.3526,0.5641,0.7903,47700,27000
Augusta University,Augusta,GA,0.0,0.0,0.0,0,515.0,515.0,0.0,5030.0,...,0.0527,0.0115,0.0221,0.1944,1,0.4340,0.5458,0.2713,NaN,12350
University of North Georgia,Dahlonega,GA,0.0,0.0,0.0,0,515.0,505.0,0.0,14976.0,...,0.0266,0.0142,0.0126,0.2900,1,0.3751,0.4028,0.1623,NaN,15000
University of Florida-Online,Gainesville,FL,0.0,0.0,0.0,0,580.0,585.0,1.0,879.0,...,0.0023,0.0046,0.0444,0.6155,1,NaN,NaN,NaN,NaN,15000
University of North Texas at Dallas,Dallas,TX,0.0,0.0,0.0,0,430.0,465.0,0.0,1623.0,...,0.0142,0.0129,0.0129,0.4060,1,0.4813,0.4791,NaN,NaN,20000

In [30]:
college.shape, college2.shape

((7535, 26), (1196, 26))

In [31]:
# UGDS : 학부생 수, SATMTMID : SAT 수학 점수 중앙값
def weight_math_average(df): # 수학평균
    weight_math = df['UGDS'] * df['SATMTMID']
    return int(weight_math.sum() / df['UGDS'].sum())

In [32]:
# STABBR : 대학이 위치한 주(state)명
# apply :  각 열(또는 행)을 반복하여 함수를 적용
college.groupby('STABBR').apply(weight_math_average).head()

STABBR
AK      5
AL    261
AR    301
AS      0
AZ     61
dtype: int64

# 객체 합치기

## 1. concat

### 1.1. Multiple Data Loading

In [33]:
df1 = pd.read_csv('data/stocks_2016.csv')
df1

  Symbol  Shares  Low  High
0   AAPL      80   95   110
1   TSLA      50   80   130
2    WMT      40   55    70

In [34]:
df2 = pd.read_csv('data/stocks_2017.csv')
df2

  Symbol  Shares  Low  High
0   AAPL      50  120   140
1     GE     100   30    40
2    IBM      87   75    95
3    SLB      20   55    85
4    TXN     500   15    23
5   TSLA     100  100   300

In [35]:
df3 = pd.read_csv('data/stocks_2018.csv')
df3

  Symbol  Shares  Low  High
0   AAPL      40  135   170
1   AMZN       8  900  1125
2   TSLA      50  220   400

In [36]:
years = 2016, 2017, 2018
type(years)

tuple

In [37]:
stock_tables = [pd.read_csv('data/stocks_{}.csv'.format(year), index_col='Symbol') for year in years]
stock_tables

[        Shares  Low  High
 Symbol
 AAPL        80   95   110
 TSLA        50   80   130
 WMT         40   55    70,         Shares  Low  High
 Symbol
 AAPL        50  120   140
 GE         100   30    40
 IBM         87   75    95
 SLB         20   55    85
 TXN        500   15    23
 TSLA       100  100   300,         Shares  Low  High
 Symbol
 AAPL        40  135   170
 AMZN         8  900  1125
 TSLA        50  220   400]

In [40]:
s_2016, s_2017, s_2018 = stock_tables
s_2017

        Shares  Low  High
Symbol
AAPL        50  120   140
GE         100   30    40
IBM         87   75    95
SLB         20   55    85
TXN        500   15    23
TSLA       100  100   300

### 1.2. 수직 병합

In [41]:
pd.concat(stock_tables)

        Shares  Low  High
Symbol
AAPL        80   95   110
TSLA        50   80   130
WMT         40   55    70
AAPL        50  120   140
GE         100   30    40
IBM         87   75    95
SLB         20   55    85
TXN        500   15    23
TSLA       100  100   300
AAPL        40  135   170
AMZN         8  900  1125
TSLA        50  220   400

In [ ]:
pd.concat(stock_tables, keys=[2016, 2017, 2018])

### 1.3. 수평 병합

In [42]:
pd.concat(stock_tables, axis='columns')

C:\ProgramData\Anaconda3\envs\[tf]\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

      Shares   Low   High  Shares    Low   High  Shares    Low    High
AAPL    80.0  95.0  110.0    50.0  120.0  140.0    40.0  135.0   170.0
AMZN     NaN   NaN    NaN     NaN    NaN    NaN     8.0  900.0  1125.0
GE       NaN   NaN    NaN   100.0   30.0   40.0     NaN    NaN     NaN
IBM      NaN   NaN    NaN    87.0   75.0   95.0     NaN    NaN     NaN
SLB      NaN   NaN    NaN    20.0   55.0   85.0     NaN    NaN     NaN
TSLA    50.0  80.0  130.0   100.0  100.0  300.0    50.0  220.0   400.0
TXN      NaN   NaN    NaN   500.0   15.0   23.0     NaN    NaN     NaN
WMT     40.0  55.0   70.0     NaN    NaN    NaN     NaN    NaN     NaN

In [44]:
# zip 함수는 동일한 갯수의 요소값을 갖는 시퀀스 자료형을 묶어주는 역할
a = [1,2,3,4,5]
b = ['a','b','c','d','e']
 
for x,y in zip (a,b):
  print  (x,y)

1 a
2 b
3 c
4 d
5 e

In [45]:
pd.concat(dict(zip(years,stock_tables)), axis='columns')

C:\ProgramData\Anaconda3\envs\[tf]\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

       2016                2017                 2018
     Shares   Low   High Shares    Low   High Shares    Low    High
AAPL   80.0  95.0  110.0   50.0  120.0  140.0   40.0  135.0   170.0
AMZN    NaN   NaN    NaN    NaN    NaN    NaN    8.0  900.0  1125.0
GE      NaN   NaN    NaN  100.0   30.0   40.0    NaN    NaN     NaN
IBM     NaN   NaN    NaN   87.0   75.0   95.0    NaN    NaN     NaN
SLB     NaN   NaN    NaN   20.0   55.0   85.0    NaN    NaN     NaN
TSLA   50.0  80.0  130.0  100.0  100.0  300.0   50.0  220.0   400.0
TXN     NaN   NaN    NaN  500.0   15.0   23.0    NaN    NaN     NaN
WMT    40.0  55.0   70.0    NaN    NaN    NaN    NaN    NaN     NaN

## 2. join

In [46]:
# lsuffix : 왼쪽 프레임의 겹치는 열에서 사용할 접미어입니다.
# rsuffix : 오른쪽 프레임의 겹치는 열에서 사용할 접미어입니다.
s_2016.join(s_2017, lsuffix='_2016', rsuffix='_2017')

        Shares_2016  Low_2016  High_2016  Shares_2017  Low_2017  High_2017
Symbol
AAPL             80        95        110         50.0     120.0      140.0
TSLA             50        80        130        100.0     100.0      300.0
WMT              40        55         70          NaN       NaN        NaN

In [47]:
s_2016.join(s_2017, lsuffix='_2016', rsuffix='_2017', how='outer')

        Shares_2016  Low_2016  High_2016  Shares_2017  Low_2017  High_2017
Symbol
AAPL           80.0      95.0      110.0         50.0     120.0      140.0
GE              NaN       NaN        NaN        100.0      30.0       40.0
IBM             NaN       NaN        NaN         87.0      75.0       95.0
SLB             NaN       NaN        NaN         20.0      55.0       85.0
TSLA           50.0      80.0      130.0        100.0     100.0      300.0
TXN             NaN       NaN        NaN        500.0      15.0       23.0
WMT            40.0      55.0       70.0          NaN       NaN        NaN

In [48]:
s_2017.add_suffix('_2017')

        Shares_2017  Low_2017  High_2017
Symbol
AAPL             50       120        140
GE              100        30         40
IBM              87        75         95
SLB              20        55         85
TXN             500        15         23
TSLA            100       100        300

In [49]:
other = [s_2017.add_suffix('_2017'), s_2018.add_suffix('_2018')]
s_2016.add_suffix('_2016').join(other, how='outer')

C:\ProgramData\Anaconda3\envs\[tf]\lib\site-packages\pandas\core\frame.py:6848: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  verify_integrity=True)

,Shares_2016,Low_2016,High_2016,Shares_2017,Low_2017,High_2017,Shares_2018,Low_2018,High_2018
AAPL,80.0,95.0,110.0,50.0,120.0,140.0,40.0,135.0,170.0
AMZN,NaN,NaN,NaN,NaN,NaN,NaN,8.0,900.0,1125.0
GE,NaN,NaN,NaN,100.0,30.0,40.0,NaN,NaN,NaN
IBM,NaN,NaN,NaN,87.0,75.0,95.0,NaN,NaN,NaN
SLB,NaN,NaN,NaN,20.0,55.0,85.0,NaN,NaN,NaN
TSLA,50.0,80.0,130.0,100.0,100.0,300.0,50.0,220.0,400.0
TXN,NaN,NaN,NaN,500.0,15.0,23.0,NaN,NaN,NaN
WMT,40.0,55.0,70.0,NaN,NaN,NaN,NaN,NaN,NaN

## 3. Merge

In [50]:
s_2016

        Shares  Low  High
Symbol
AAPL        80   95   110
TSLA        50   80   130
WMT         40   55    70

In [51]:
s_2017

        Shares  Low  High
Symbol
AAPL        50  120   140
GE         100   30    40
IBM         87   75    95
SLB         20   55    85
TXN        500   15    23
TSLA       100  100   300

In [52]:
s_2016.merge(s_2017, left_index=True, right_index=True)

        Shares_x  Low_x  High_x  Shares_y  Low_y  High_y
Symbol
AAPL          80     95     110        50    120     140
TSLA          50     80     130       100    100     300

In [53]:
step1 = s_2016.merge(s_2017, left_index=True, right_index=True, how='outer', suffixes=('_2016','_2017'))
step1

        Shares_2016  Low_2016  High_2016  Shares_2017  Low_2017  High_2017
Symbol
AAPL           80.0      95.0      110.0         50.0     120.0      140.0
GE              NaN       NaN        NaN        100.0      30.0       40.0
IBM             NaN       NaN        NaN         87.0      75.0       95.0
SLB             NaN       NaN        NaN         20.0      55.0       85.0
TSLA           50.0      80.0      130.0        100.0     100.0      300.0
TXN             NaN       NaN        NaN        500.0      15.0       23.0
WMT            40.0      55.0       70.0          NaN       NaN        NaN

In [54]:
s_merge = step1.merge(s_2018.add_suffix('_2018'), left_index=True, right_index=True, how='outer')
s_merge

,Shares_2016,Low_2016,High_2016,Shares_2017,Low_2017,High_2017,Shares_2018,Low_2018,High_2018
Symbol,,,,,,,,,
AAPL,80.0,95.0,110.0,50.0,120.0,140.0,40.0,135.0,170.0
AMZN,NaN,NaN,NaN,NaN,NaN,NaN,8.0,900.0,1125.0
GE,NaN,NaN,NaN,100.0,30.0,40.0,NaN,NaN,NaN
IBM,NaN,NaN,NaN,87.0,75.0,95.0,NaN,NaN,NaN
SLB,NaN,NaN,NaN,20.0,55.0,85.0,NaN,NaN,NaN
TSLA,50.0,80.0,130.0,100.0,100.0,300.0,50.0,220.0,400.0
TXN,NaN,NaN,NaN,500.0,15.0,23.0,NaN,NaN,NaN
WMT,40.0,55.0,70.0,NaN,NaN,NaN,NaN,NaN,NaN

## 4. 병합의 활용

In [55]:
names = ['prices', 'transactions']
food_tables = [pd.read_csv('data/food_{}.csv'.format(name)) for name in names]
food_prices, food_tr = food_tables

In [56]:
food_prices

     item store  price  Date
0    pear     A   0.99  2017
1    pear     B   1.99  2017
2   peach     A   2.99  2017
3   peach     B   3.49  2017
4  banana     A   0.39  2017
5  banana     B   0.49  2017
6   steak     A   5.99  2017
7   steak     B   6.99  2017
8   steak     B   4.99  2015

In [57]:
food_tr

   custid     item store  quantity
0       1     pear     A         5
1       1   banana     A        10
2       2    steak     B         3
3       2     pear     B         1
4       2    peach     B         2
5       2    steak     B         1
6       2  coconut     B         4

In [58]:
food_tr.merge(food_prices, on=['item','store'])

   custid    item store  quantity  price  Date
0       1    pear     A         5   0.99  2017
1       1  banana     A        10   0.39  2017
2       2   steak     B         3   6.99  2017
3       2   steak     B         3   4.99  2015
4       2   steak     B         1   6.99  2017
5       2   steak     B         1   4.99  2015
6       2    pear     B         1   1.99  2017
7       2   peach     B         2   3.49  2017

In [59]:
food_tr.merge(food_prices.query('Date==2017'), how='left')

   custid     item store  quantity  price    Date
0       1     pear     A         5   0.99  2017.0
1       1   banana     A        10   0.39  2017.0
2       2    steak     B         3   6.99  2017.0
3       2     pear     B         1   1.99  2017.0
4       2    peach     B         2   3.49  2017.0
5       2    steak     B         1   6.99  2017.0
6       2  coconut     B         4    NaN     NaN

In [60]:
f_join = food_prices.query('Date==2017').set_index(['item','store'])

In [61]:
food_tr.join(f_join, on=['item','store'])

   custid     item store  quantity  price    Date
0       1     pear     A         5   0.99  2017.0
1       1   banana     A        10   0.39  2017.0
2       2    steak     B         3   6.99  2017.0
3       2     pear     B         1   1.99  2017.0
4       2    peach     B         2   3.49  2017.0
5       2    steak     B         1   6.99  2017.0
6       2  coconut     B         4    NaN     NaN

In [ ]:
pd.concat([food_tr.set_index(['item','store']), food_prices.set_index(['item','store'])], axis='columns')

In [ ]:
import matplotlib.pyplot as plt
import seaborn as sns
sns.set(style='whitegrid', palette='muted')
%matplotlib inline

In [ ]:
data = pd.read_csv('data/breast_cancer.csv')

**데이터 확인**

In [ ]:
data.head()

In [ ]:
data.info()

- ID는 분석대상이 아님
- 목표변수: Diagnosis
- Unnamed: 32 열은 모두 NULL값이므로 제거가 필요

**필요 없는 변수 제거 및 x, y 분할**

In [ ]:
col = data.columns
col

In [ ]:
del_col = ['Unnamed: 32', 'id', 'diagnosis']
y = data.diagnosis
x = data.drop(del_col, axis=1)
x.head()

**데이터 살펴보기**

In [ ]:
ax = sns.countplot(y, label='count')
B, M = y.value_counts()
print('양성 :', B)
print('음성 :', M)

In [ ]:
x.describe()

In [ ]:
#!pip install pandas_profiling
import pandas_profiling as pp

In [ ]:
pp.ProfileReport(data)

**데이터 시각화-1 : Violinplot**

In [ ]:
sns.set(style='whitegrid', palette='muted')
graph_data = (x - x.mean()) / (x.std())
graph_data = pd.concat([y, graph_data.iloc[:,0:10]], axis=1)
graph_data = pd.melt(graph_data, id_vars='diagnosis',var_name='features', value_name='value')
plt.figure(figsize=(10,10))
sns.violinplot(x='features', y='value', hue='diagnosis', data=graph_data, split=True, inner='quart')
plt.xticks(rotation=90);

**데이터 시각화-2 : Box Plot**

In [ ]:
graph_data = (x - x.mean()) / (x.std())
graph_data = pd.concat([y, graph_data.iloc[:,20:31]], axis=1)
graph_data = pd.melt(graph_data, id_vars='diagnosis',var_name='features', value_name='value')
plt.figure(figsize=(10,10))
sns.boxplot(x='features', y='value', hue='diagnosis', data=graph_data)
plt.xticks(rotation=90);

**데이터 시각화-3 : Swarm Plot**

In [ ]:
plt.figure(figsize=(10,10))
sns.swarmplot(x='features', y='value', hue='diagnosis', data=graph_data)
plt.xticks(rotation=90);

**변수간 상관관계 파악 1 - 두변수간 상관 관계**

In [ ]:
sns.jointplot(x.loc[:, 'concavity_worst'], x.loc[:, 'concave points_worst'], kind='regg');

**변수간 상관관계 파악 2 - 세 변수 이상 상관 관계**

In [ ]:
df = x.loc[:, ['radius_worst','perimeter_worst','area_worst']]
g = sns.PairGrid(df, diag_sharey=False)
g.map_lower(sns.kdeplot)
g.map_upper(plt.scatter)
g.map_diag(sns.kdeplot);

**변수간 상관관계 파악 3 - HeatMap**

In [ ]:
plt.figure(figsize=(18,18))
sns.heatmap(x.corr(), annot=True, linewidth=.5, fmt='.1f');